/*-------------------------------------------------*/
/*            超纬电子STM32系列开发板              */
/*-------------------------------------------------*/
/*                                                 */
/*              实现LED功能的源文件                */
/*                                                 */
/*-------------------------------------------------*/

#include "stm32f10x.h"  //包含需要的头文件
#include "motor.h"        //包含需要的头文件

/*-------------------------------------------------*/
/*函数名：初始化LED函数                            */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_Init(void)
{    	 
		GPIO_InitTypeDef GPIO_InitStructure;                         //定义一个设置GPIO的变量
		RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOD, ENABLE);       //使能GPIOD端口时钟

		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;                    //设置PD2
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;   		 //推免输出方式
		GPIO_Init(GPIOD, &GPIO_InitStructure);            		          
}



/*-------------------------------------------------*/
/*函数名：点亮所有LED                              */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_AllOn(void)
{
	LED2_ON;
}

/*-------------------------------------------------*/
/*函数名：熄灭所有LED                              */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void LED_AllOff(void)
{
	LED2_OFF;
}



